SET search_path TO codeit;

/*
01. GROUP BY 및 HAVING 및 ORDER BY 관련 예제
*/


/* Q1)
사원들의 급여의 총 합을 조회하시오.
*/



/* Q2)
사원들의 급여의 평균을 구하시오.
*/



/* Q3)
employee 테이블에서 부서 코드별 그룹을 지정하여
부서코드, 그룹별 급여의 합계, 그룹별 급여의 평균(정수처리), 인원수를 조회하고,
부서코드 순으로 오름차순 정렬하시오.
*/



/* Q2)
employee 테이블에서 직급별 직급코드, 보너스를 받는 사원수를 조회하여
직급코드 순으로 오름차순 정렬하시오.
*/



/* Q3) HARD!!
employee 테이블에서 주민번호의 8번 째 자리를 조회하여 1이면 남, 2면 여로 결과를 조회하고
성별별 급여 평균(정수처리), 급여 합계, 인원수를 조회한 뒤
인원수로 내림차순 정렬하시오.
*/



/* Q4)
300만원 이상을 받는 사원들의 부서별 평균 급여를 조회하시오.
(힌트: 평균 급여는 FLOOR()를 사용해 적절히 잘라내야 할 수도 있다)
*/


/* Q5)
평균이 300만원 이상인 부서 사원들의 평균 급여를 조회하시오.
(힌트: 평균 급여는 FLOOR()를 사용해 적절히 잘라내야 할 수도 있다)
*/



/* Q6)
급여 합계가 가장 많은 부서의 부서 코드와 급여 합계를 구하시오.
*/
