SET search_path TO codeit;

/*
01. SUBQUERY 관련 예제
*/

/* Q1)
사원명이 '노홍철'인 사원의 부서코드와 같은 부서에 속한 직원의 이름과 부서코드를 조회하시오.
(힌트: 서브쿼리, WHERE 절)
*/


/* Q2)
전 직원의 평균 급여보다 많은 급여를 받고 있는 직원의 사번, 이름, 직급코드, 급여를 조회하시오.
(힌트: 서브쿼리, AVG, WHERE 절)
*/


/* Q3)
노홍철 사원의 급여보다 많은 급여를 받고 있는 사원의 사번, 이름, 부서코드, 직급코드, 급여를 조회하시오.
(힌트: 서브쿼리, WHERE 절)
*/


/* Q4)
가장 적은 급여를 받는 직원의 사번, 이름, 직급코드, 부서코드, 급여, 입사일을 조회하시오.
(힌트: 서브쿼리, MIN, WHERE 절)
*/


/* Q5)
부서별 급여 합계 중 가장 큰 부서의 부서명, 급여 합계를 조회하시오.
(힌트: 서브쿼리, GROUP BY, HAVING 절)
*/


/* Q6)
부서별 최고 급여를 받는 직원의 이름, 직급, 부서, 급여를 조회하시오.
(힌트: 서브쿼리, IN 연산자)
*/



/* Q7)
과장 직급의 최소 급여보다 많이 받는 대리 직급의 사번, 이름, 직급명, 급여를 조회하시오.
*/


/* Q8)
직급별 급여 평균을 조회하시오.
(힌트: 서브쿼리, GROUP BY)
*/



